# PrinterName Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PrintManager..::..PrinterName Property
PrintManager Class See Also
---
The name of the current printer.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public string PrinterName { get; }
```

Visual Basic
---
```text
Public ReadOnly Property PrinterName As String
	Get
```

Visual C++
---
```text
public:
property String^ PrinterName {
	String^ get ();
}
```

# See Also
PrintManager Class
Autodesk.Revit.DB Namespace